UNCCStudyApp/app/views/building/show.html.erb

<h1>Locations</h1>
<% @building.locations.each do |l| %>
---
SELECT "locations".* FROM "locations" WHERE "locations"."building_id" = ?  [["building_id", 1]]