UNCCStudyApp/app/controllers/building_controller.rb

    def index
        @building = Building.all
---
SELECT "buildings".* FROM "buildings"

    def show
        @building = Building.find(params[:id])
        @location = Location.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."building_id" = ?  [["building_id", 1]]