UNCCStudyApp/app/controllers/comments_controller.rb

    def create
        @location = Location.find(params[:article_id])
        @comment = @location.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["created_at", "2018-04-11 17:14:13.380980"], ["updated_at", "2018-04-11 17:14:13.380980"]]