Study/app/controllers/locations_controller.rb

  def index
    @l1 = Location.where("buildingName = 'Woodward'")
---
SELECT "locations".* FROM "locations" WHERE (buildingName = 'Woodward')